Revit 2027 API
BuiltInFailures.MEPFabricationFailures.FabDbOpenJobConn Property
 Fabrication job imported had bad connectivity
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FabDbOpenJobConn { get; }
Public Shared ReadOnly Property FabDbOpenJobConn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FabDbOpenJobConn {
	FailureDefinitionId^ get ();
}
static member FabDbOpenJobConn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace